class StringBuilder {
  #value;

  constructor(initialValue) {
    this.#value = initialValue;
  }

  getValue() {
  return this.#value;
  }

  padStart(str) {
    // this.#value = str + this.#value;
    this.#value = `${str}${this.#value}`;
  }

  padEnd(str) {
    this.#value += str;
  }

  padBoth(str) {
    this.#value = str + this.#value + str;
  }
};

const builder = new StringBuilder(".");

console.log(builder.getValue()); // "."

builder.padStart("^");
console.log(builder.getValue()); // "^."

builder.padEnd("^");
console.log(builder.getValue()); // "^.^"

builder.padBoth("=");
console.log(builder.getValue()); // "=^.^="

// ---------- REMARKS OF THE MENTOR ---------- //

// Проблема була вирішена з незначними покращеннями, які потрібно зробити.

// task-3.js - Well executed moments/Добре виконані моменти //

// Гарна структура класу: ваша структура класу добре організована, і методи реалізовані згідно зі специфікаціями задачі.

// Ефективне використання приватної властивості: реалізація #value, як приватної властивості забезпечує хорошу інкапсуляцію
// для змінної екземпляра.

// Правильна реалізація методу getValue: метод getValue правильно повертає значення властивості.

// task-3.js - Improvement/Покращення //

// Форматування коду: хоча логіка вашого коду правильна, ви можете покращити читабельність коду,
// використовуючи послідовне відступання в методах padStart, padEnd і padBoth. Важливо зберігати послідовне форматування коду,
// щоб зробити його легким для читання і підтримки.

// Використання шаблонних рядків: з метою послідовності та зрозумілості розгляньте використання шаблонних рядків у методі padStart,
// аналогічно до того, як ви використали їх у конструкторі. Це забезпечить послідовний стиль злиття рядків у всьому вашому класі.

// Зайві коментарі: коментар у верхній частині вашого коду здається заголовком або описом на іншій мові.
// Такі коментарі повинні бути зрозумілими і використовувати мову решти коду, якщо не зазначено інше. Крім того, переконайтеся,
// що коментарі корисні та інформативні; у цьому випадку коментар, схоже, не надає додаткової ясності.

// Завдання було прийнято з пропозицією поліпшити форматування коду для кращої читабельності.
